In [1]:
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt
import import_ipynb
from Student_info import country_Student
from Student_info import student_info

importing Jupyter notebook from Student_info.ipynb
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35230 entries, 0 to 35229
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   student_id       35230 non-null  int64
 1   student_country  35217 non-null  object
 2   date_registered  35230 non-null  object
dtypes: int64(1), object(2)
memory usage: 825.8+ KB

In [14]:
student_purchases = pd.read_csv('dataSets/365_database/365_student_purchases.csv')
student_purchases
student_purchases['purchase_type'].unique()

array(['Annual', 'Monthly', 'Quarterly'], dtype=object)

In [3]:
missing_country_df = student_info[student_info.isnull().any(axis=1)]
missing_country = missing_country_df['student_id'].tolist()
missing_country

[261725,
 262665,
 272144,
 278827,
 282654,
 282914,
 283704,
 283791,
 284550,
 284790,
 286959,
 290648,
 293967]

In [6]:
df = student_purchases.copy()

df_cleaned = df[~df['student_id'].isin(missing_country)]
student_purchases_cleaned = df_cleaned.reset_index(drop=True)
(student_purchases_cleaned)

      purchase_id  student_id purchase_type date_purchased
0           15781      258800        Annual     2022-01-01
1           15786      258803        Annual     2022-01-01
2           15808      258862        Annual     2022-01-01
3           15809      258865        Annual     2022-01-01
4           15811      258878        Annual     2022-01-01
...           ...         ...           ...            ...
3035        23148      278055       Monthly     2022-10-20
3036        23150      270103        Annual     2022-10-20
3037        23151      270824       Monthly     2022-10-20
3038        23152      295497       Monthly     2022-10-20
3039        23153      295506        Annual     2022-10-20

[3040 rows x 4 columns]

In [8]:
country = []
i = 0
n = len(student_purchases_cleaned)-1

while (i<=n):
    x=student_purchases_cleaned['student_id'].loc[i]
    y=country_Student[x]
    country.append(y)
    i=i+1

In [10]:
print(len(country))
df_country = pd.DataFrame(country,columns = ['country'])
df_country

3040

     country
0         CA
1         US
2         NL
3         CA
4         CA
...      ...
3035      ZW
3036      GB
3037      US
3038      NL
3039      GB

[3040 rows x 1 columns]

In [11]:
frames = [student_purchases_cleaned, df_country]

student_purchases_by_country = pd.concat(frames,axis = 1)

student_purchases_by_country

      purchase_id  student_id purchase_type date_purchased country
0           15781      258800        Annual     2022-01-01      CA
1           15786      258803        Annual     2022-01-01      US
2           15808      258862        Annual     2022-01-01      NL
3           15809      258865        Annual     2022-01-01      CA
4           15811      258878        Annual     2022-01-01      CA
...           ...         ...           ...            ...     ...
3035        23148      278055       Monthly     2022-10-20      ZW
3036        23150      270103        Annual     2022-10-20      GB
3037        23151      270824       Monthly     2022-10-20      US
3038        23152      295497       Monthly     2022-10-20      NL
3039        23153      295506        Annual     2022-10-20      GB

[3040 rows x 5 columns]

In [15]:
student_purchase_annual =student_purchases_by_country[student_purchases_by_country['purchase_type']=='Annual']
student_purchase_quarterly =student_purchases_by_country[student_purchases_by_country['purchase_type']=='Quarterly']
student_purchase_monthly =student_purchases_by_country[student_purchases_by_country['purchase_type']=='Monthly']
student_purchase_quarterly

      purchase_id  student_id purchase_type date_purchased country
66          16023      260164     Quarterly     2022-01-12      JM
67          16027      260173     Quarterly     2022-01-13      US
188         16459      259171     Quarterly     2022-01-25      US
268         16665      261979     Quarterly     2022-01-31      NG
277         16698      261608     Quarterly     2022-02-02      US
298         16764      262643     Quarterly     2022-02-06      CA
331         16880      262973     Quarterly     2022-02-09      US
414         17129      262714     Quarterly     2022-02-20      PH
510         17416      264856     Quarterly     2022-03-04      IN
560         17529      262221     Quarterly     2022-03-10      IN
853         18292      269796     Quarterly     2022-04-06      IN
912         18408      270240     Quarterly     2022-04-10      DE
935         18449      260164     Quarterly     2022-04-12      JM
944         18481      260173     Quarterly     2022-04-13      US
996         18675      262270     Quarterly     2022-04-19      US
1002        18694      268863     Quarterly     2022-04-20      ZA
1036        18842      261564     Quarterly     2022-04-25      US
1091        19021      261608     Quarterly     2022-05-02      US
1175        19223      272977     Quarterly     2022-05-11      US
1246        19387      263888     Quarterly     2022-05-18      US
1257        19403      262714     Quarterly     2022-05-20      PH
1275        19433      264295     Quarterly     2022-05-20      US
1649        20252      271837     Quarterly     2022-06-18      TN
1687        20325      278890     Quarterly     2022-06-22      DE
1748        20491      279738     Quarterly     2022-06-30      EC
1788        20603      280461     Quarterly     2022-07-05      GB
1810        20648      280346     Quarterly     2022-07-08      US
1817        20664      280814     Quarterly     2022-07-08      HK
1833        20706      270240     Quarterly     2022-07-10      DE
1864        20765      260173     Quarterly     2022-07-13      US
1894        20835      272596     Quarterly     2022-07-16      BG
2010        21084      261564     Quarterly     2022-07-25      US
2044        21161      282442     Quarterly     2022-07-26      IN
2167        21401      261608     Quarterly     2022-08-02      US
2183        21423      272696     Quarterly     2022-08-04      NL
2190        21438      283745     Quarterly     2022-08-04      US
2230        21509      284241     Quarterly     2022-08-08      TW
2307        21653      285344     Quarterly     2022-08-16      MY
2355        21747      264295     Quarterly     2022-08-20      US
2436        21941      282507     Quarterly     2022-08-29      NG
2451        21982      274166     Quarterly     2022-08-31      US
2628        22347      291400     Quarterly     2022-09-20      AE
2629        22348      291401     Quarterly     2022-09-20      AE
2711        22509      291626     Quarterly     2022-09-25      GB
2838        22750      279738     Quarterly     2022-09-30      EC
2868        22810      293251     Quarterly     2022-10-04      NG
2882        22839      280461     Quarterly     2022-10-05      GB
2946        22963      292048     Quarterly     2022-10-12      CA
2950        22968      281074     Quarterly     2022-10-12      US
2963        23003      260173     Quarterly     2022-10-13      US